#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_service_account.airflow: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket: Refreshing state... [id=nyc-taxi-dev-dtc-dataops-dev-366316]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.big_query will be created
  + resource "google_bigquery_dataset" "big_query" {
      + creation_time              = (known after apply)
      + dataset_id                 = "trips_data_all"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + friendly_name              = "BigQuery: NYC Taxi Data"
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "us-west1"
      + project                    = "dtc-dataops-dev-366316"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_project_iam_member.account_user will be created
  + resource "google_project_iam_member" "account_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dtc-dataops-dev-366316"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.airflow["roles/bigquery.dataEditor"] will be created
  + resource "google_project_iam_member" "airflow" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
      + project = "dtc-dataops-dev-366316"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.airflow["roles/storage.objectAdmin"] will be created
  + resource "google_project_iam_member" "airflow" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
      + project = "dtc-dataops-dev-366316"
      + role    = "roles/storage.objectAdmin"
    }

  # google_project_iam_member.composer-editor will be created
  + resource "google_project_iam_member" "composer-editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dtc-dataops-dev-366316"
      + role    = "roles/editor"
    }

  # google_project_iam_member.composer_worker will be created
  + resource "google_project_iam_member" "composer_worker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dtc-dataops-dev-366316"
      + role    = "roles/composer.worker"
    }

  # google_service_account.composer_admin will be created
  + resource "google_service_account" "composer_admin" {
      + account_id   = "composer-admin"
      + disabled     = false
      + display_name = "Composer Admin"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "dtc-dataops-dev-366316"
      + unique_id    = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*